i. Importing

In [1]:
%pip install jupysql --quiet

Note: you may need to restart the kernel to use updated packages.

In [2]:
%load_ext sql

ii. create table that has (CustID, CustName, Age, City, Salary)

In [3]:
%%sql sqlite://
CREATE TABLE customer(
    CustID int8 PRIMARY KEY,
    CustName varchar(50) NOT NULL,
    Age int8 NOT NULL,
    City CHAR(10) NOT NULL,
    Salary numeric
)

Connecting to 'sqlite://'

++
||
++
++

## iii. insert the values

In [8]:
%%sql sqlite://
INSERT INTO customer
(CustID, CustName, Age, City, Salary)
VALUES
(1, 'Sam', 26, 'Delhi', 9000),
(2, 'Ram', 19, 'Bangalore', 11000),
(3, 'Pam', 31, 'Mumbai', 6000),
(4, 'Jam', 42, 'Pune', 10000);

4 rows affected.

++
||
++
++

## iv. use select stament to show the data

In [9]:
%%sql sqlite://
SELECT * FROM customer;

+--------+----------+-----+-----------+--------+
| CustID | CustName | Age |    City   | Salary |
+--------+----------+-----+-----------+--------+
|   5    |   sid    |  21 |   Mumbai  | 600000 |
|   6    |   jone   |  19 |    Pune   | 11000  |
|   7    |  Pnadu   |  31 |   Panjab  |  6000  |
|   8    |  Joshep  |  42 |   Mohali  | 10000  |
|   1    |   Sam    |  26 |   Delhi   |  9000  |
|   2    |   Ram    |  19 | Bangalore | 11000  |
|   3    |   Pam    |  31 |   Mumbai  |  6000  |
|   4    |   Jam    |  42 |    Pune   | 10000  |
+--------+----------+-----+-----------+--------+

## v. update the values in Table

In [11]:
%%sql sqlite://
UPDATE customer 
SET Age=28 where CustID=1;

1 rows affected.

++
||
++
++

In [13]:
%%sql sqlite://
UPDATE customer 
set Age = 22 , Salary=700000 where CustID=5;

1 rows affected.

++
||
++
++

## vi. Delete values in Table

In [15]:
%%sql sqlite://
DELETE FROM customer where CustID=7;

1 rows affected.

++
||
++
++

## vii. ALTER Table

In [17]:
'''• ADD Column Syntax: Adding new ‘Gender’ column to customer table
ALTER TABLE customer
ADD COLUMN Gender varchar(10);

• ALTER/MODIFY COLUMN Syntax: changing Gender column data type from varchar(10) to char(10)
ALTER TABLE customer
ALTER COLUMN Gender char(10);

• DROP COLUMN Syntax: Deleting Gender column from customer table
ALTER TABLE customer
DROP COLUMN Gender; '''

'• ADD Column Syntax: Adding new ‘Gender’ column to customer table\nALTER TABLE customer\nADD COLUMN Gender varchar(10);\n\n• ALTER/MODIFY COLUMN Syntax: changing Gender column data type from varchar(10) to char(10)\nALTER TABLE customer\nALTER COLUMN Gender char(10);\n\n• DROP COLUMN Syntax: Deleting Gender column from customer table\nALTER TABLE customer\nDROP COLUMN Gender; '

## viii. Drop & Truncate Table

In [18]:
'''
The DROP TABLE command deletes a table in the database :
-> DROP TABLE table_name;

The TRUNCATE TABLE command deletes the data inside a table, but not the table itself:
-> TRUNCATE TABLE table_name; '''

'\nThe DROP TABLE command deletes a table in the database :\n-> DROP TABLE table_name;\n\nThe TRUNCATE TABLE command deletes the data inside a table, but not the table itself:\n-> TRUNCATE TABLE table_name; '

## ix. SELECT & WHERE CLAUSE

In [19]:
%%sql sqlite://
SELECT * FROM customer;

+--------+----------+-----+-----------+--------+
| CustID | CustName | Age |    City   | Salary |
+--------+----------+-----+-----------+--------+
|   5    |   sid    |  22 |   Mumbai  | 700000 |
|   6    |   jone   |  19 |    Pune   | 11000  |
|   8    |  Joshep  |  42 |   Mohali  | 10000  |
|   1    |   Sam    |  28 |   Delhi   |  9000  |
|   2    |   Ram    |  19 | Bangalore | 11000  |
|   3    |   Pam    |  31 |   Mumbai  |  6000  |
|   4    |   Jam    |  42 |    Pune   | 10000  |
+--------+----------+-----+-----------+--------+

In [20]:
%%sql sqlite://
SELECT CustName , Age from customer;

+----------+-----+
| CustName | Age |
+----------+-----+
|   sid    |  22 |
|   jone   |  19 |
|  Joshep  |  42 |
|   Sam    |  28 |
|   Ram    |  19 |
|   Pam    |  31 |
|   Jam    |  42 |
+----------+-----+

Where Clause

In [21]:
%%sql sqlite://
SELECT * from customer where Age > 25;

+--------+----------+-----+--------+--------+
| CustID | CustName | Age |  City  | Salary |
+--------+----------+-----+--------+--------+
|   8    |  Joshep  |  42 | Mohali | 10000  |
|   1    |   Sam    |  28 | Delhi  |  9000  |
|   3    |   Pam    |  31 | Mumbai |  6000  |
|   4    |   Jam    |  42 |  Pune  | 10000  |
+--------+----------+-----+--------+--------+

In [ ]:
%%sql sqlite://